[
  {
    "title": "Basic AI Assistant",
    "description": "A weak AI voice assistant made using Python and Neural Network. Can perform a web search, get information from wiki, open a website. Uses voice to open application, tell date and time, take screenshot.",
    "techIcons": ["SiPython"]
},
{
    "title": "Doorbell Notification using NodeMCU",
    "description": "Using existing doorbell system sending notification using NodeMCU. Uses PushOver API to send notification to Phone. Very Cheap and Easy to apply on any existing system.",
    "techIcons": ["SiNodedotjs", "SiArduino"]
},
{
    "title": "RFID Based Access Control System",
    "description": "NodeMCU-powered RFID access control system for secure entry management. Use NodeMCU to create a system that lets only authorized people enter by scanning cards. Can be also used as an Attendance system and store data remotely.",
    "techIcons": ["SiNodedotjs", "SiArduino"]
},
{
    "title": "Zwitter",
    "description": "A Social Media Application using MERN stack. Features: Authentication, Authorization, Create User, Make Post, add Friends. Deployed on Frontend on AWS Amplify and Backend on Linode Linux server.",
    "techIcons": ["SiReact", "SiNodedotjs", "SiMongodb", "SiExpress"]
},
{
    "title": "AttendZone",
    "description": "An ongoing geo-location based attendance application. Geo-fencing: Admin sets location limit, users mark attendance if inside. Uses Facial and Fingerprint recognition for Authentication.",
    "techIcons": ["SiReact", "SiNodedotjs"]
},
{
    "title": "School EPR system",
    "description": "An Online ERP website for school. Manages school data: student attendance, grades, fees; tracks teacher information. Developed with HTML, CSS, JavaScript for the front end, and PHP for the backend.",
    "techIcons": ["SiHtml5", "SiCss3", "SiJavascript", "SiPhp"]
},
{
    "title": "Online PvP Rock Paper Scissors",
    "description": "Online PvP Rock Paper Scissors game with animated visuals using Pygame. Players can create private rooms and join existing rooms for exclusive multiplayer sessions. Real-time gaming interactions through the dynamic Pygame platform.",
    "techIcons": ["SiPython"]
},
{
    "title": "Marksheet Generator",
    "description": "A Student Marksheet Generation system built using Java applet. Java applet-based tool that generates student marksheets, computes grace marks for borderline passing, and assigns grades. Automates grade calculation for failing marks.",
    "techIcons": ["FaJava"]
},
{
    "title": "Delight Cafe",
    "description": "A Café billing system built using Java applet. Automates bill generation for orders at the café. Utilizes Java applet for user-friendly interface and efficient billing process.",
    "techIcons": ["FaJava"]
}
]